In [2]:
import pandas as pd
from pandas import read_csv
filename = "clean/breastCancer.csv"
data = read_csv(filename)
data.head()

,AGE,MENOPAUSE,TUMOUR_SIZE,INV_NODES,NODE_CAPS,DEG_MALIG,BREAST,BREAST_QUAD,IRRIDIAT,CLASS
0,2,2,2.0,0,1.0,NaN,1,2,0,1
1,3,0,2.0,0,NaN,0.0,1,0,0,0
1,3,0,2.0,0,NaN,0.0,1,0,0,0
2,3,0,NaN,0,0.0,1.0,0,1,0,1
3,2,2,6.0,0,1.0,2.0,1,1,1,0

In [3]:
data.drop(1, axis=0, inplace=True)

In [5]:
data.head()

,AGE,MENOPAUSE,TUMOUR_SIZE,INV_NODES,NODE_CAPS,DEG_MALIG,BREAST,BREAST_QUAD,IRRIDIAT,CLASS
0,2,2,2.0,0,1.0,NaN,1,2,0,1
2,3,0,NaN,0,0.0,1.0,0,1,0,1
3,2,2,6.0,0,1.0,2.0,1,1,1,0
4,2,2,5.0,4,1.0,1.0,0,4,0,1
5,3,2,4.0,4,0.0,1.0,1,2,1,0

In [7]:
data.drop([2,3,4], axis=0, inplace=True)

KeyError: '[2 3 4] not found in axis'

In [9]:
data.head()

,AGE,MENOPAUSE,TUMOUR_SIZE,INV_NODES,NODE_CAPS,DEG_MALIG,BREAST,BREAST_QUAD,IRRIDIAT,CLASS
0,2,2,2.0,0,1.0,NaN,1,2,0,1
5,3,2,4.0,4,0.0,1.0,1,2,1,0
6,3,0,7.0,0,0.0,2.0,0,2,0,0
7,2,2,1.0,0,0.0,1.0,0,2,0,0
8,2,2,0.0,0,0.0,1.0,1,3,0,0

In [11]:
data.drop('AGE', axis=1, inplace=True)
data.head()

KeyError: "['AGE'] not found in axis"

In [12]:
data.drop(['MENOPAUSE','BREAST'], axis=1, inplace=True)
data.head()

   TUMOUR_SIZE  INV_NODES  NODE_CAPS  DEG_MALIG  BREAST_QUAD  IRRIDIAT  CLASS
0          2.0          0        1.0        NaN            2         0      1
5          4.0          4        0.0        1.0            2         1      0
6          7.0          0        0.0        2.0            2         0      0
7          1.0          0        0.0        1.0            2         0      0
8          0.0          0        0.0        1.0            3         0      0

In [14]:
data.duplicated().sum()

84

In [17]:
data.drop_duplicates(keep='first', inplace=True)

In [19]:
data.duplicated().sum()

0

In [21]:
filename = "clean/sales.csv"
df = read_csv(filename)
df.head()

    rate  sales_in_first_month  sales_in_second_month  sales_in_third_month
0    two                     2                    500                   300
1    six                     4                    300                   650
2   four                   600                    200                   400
3   nine                   450                    320                   650
4  seven                   600                    250                   350

In [22]:
df.dtypes

rate                     object
sales_in_first_month      int64
sales_in_second_month     int64
sales_in_third_month      int64
dtype: object

In [23]:
def words_to_number(df):
    my_dict = {'one':1, 'two':2, 'three':3, 'four':4, 'five':5, 'six':6, 'seven':7, 'eight':8, 'nine':9, 'ten':10, 'eleven':11, 'twelve':12, 'zero':0, 0:0}
    return my_dict[df]

In [24]:
x = df.iloc[:, :3]
y = df.iloc[:, -1:]

In [26]:
x.head()

    rate  sales_in_first_month  sales_in_second_month
0    two                     2                    500
1    six                     4                    300
2   four                   600                    200
3   nine                   450                    320
4  seven                   600                    250

In [28]:
y.head()

   sales_in_third_month
0                   300
1                   650
2                   400
3                   650
4                   350

In [30]:
x['rate'].head()

0      two
1      six
2     four
3     nine
4    seven
Name: rate, dtype: object

In [31]:
x['rate'] = x['rate'].apply(lambda x : words_to_number(x))

In [33]:
x['rate'].head()

0    2
1    6
2    4
3    9
4    7
Name: rate, dtype: int64

In [35]:
information = pd.concat([x,y], axis=1)

In [37]:
information.head()

   rate  sales_in_first_month  sales_in_second_month  sales_in_third_month
0     2                     2                    500                   300
1     6                     4                    300                   650
2     4                   600                    200                   400
3     9                   450                    320                   650
4     7                   600                    250                   350

In [40]:
information.to_csv("clean/sales_safi.csv")

In [42]:
filename = "clean/breastcancers.csv"
dataset = read_csv(filename)
dataset.head()

,AGE,MENOPAUSE,TUMOUR_SIZE,INV_NODES,NODE_CAPS,DEG_MALIG,BREAST,BREAST_QUAD,IRRIDIAT,CLASS
0,'40-49','premeno','15-19','0-2','yes','3','right','left_up','no','recurrence-events'
1,'50-59','ge40','15-19','0-2','no','1','right','central','no','no-recurrence-events'
2,'50-59','ge40','35-39','0-2','no','2','left','left_low','no','recurrence-events'
3,'40-49','premeno','35-39','0-2','yes','3','right','left_low','yes','no-recurrence-events'
4,'40-49','premeno','30-34','3-5','yes','2','left','right_up','no','recurrence-events'

In [44]:
dataset.dtypes

AGE            object
MENOPAUSE      object
TUMOUR_SIZE    object
INV_NODES      object
NODE_CAPS      object
DEG_MALIG      object
BREAST         object
BREAST_QUAD    object
IRRIDIAT       object
CLASS          object
dtype: object

In [45]:
from sklearn import preprocessing
from sklearn.preprocessing import LabelEncoder

In [46]:
def categorical_transform(dataset):
    le = preprocessing.LabelEncoder()
    dataset.AGE = le.fit_transform(dataset.AGE)
    dataset.MENOPAUSE = le.fit_transform(dataset.MENOPAUSE)
    dataset.TUMOUR_SIZE = le.fit_transform(dataset.TUMOUR_SIZE)
    dataset.INV_NODES = le.fit_transform(dataset.INV_NODES)
    dataset.NODE_CAPS = le.fit_transform(dataset.NODE_CAPS)
    dataset.DEG_MALIG = le.fit_transform(dataset.DEG_MALIG) 
    dataset.BREAST = le.fit_transform(dataset.BREAST)
    dataset.BREAST_QUAD = le.fit_transform(dataset.BREAST_QUAD )
    dataset.IRRIDIAT = le.fit_transform(dataset.IRRIDIAT )
    dataset.CLASS = le.fit_transform(dataset.CLASS)

In [47]:
categorical_transform(dataset)

In [49]:
dataset.head()

,AGE,MENOPAUSE,TUMOUR_SIZE,INV_NODES,NODE_CAPS,DEG_MALIG,BREAST,BREAST_QUAD,IRRIDIAT,CLASS
0,2,2,2,0,1,2,1,2,0,1
1,3,0,2,0,0,0,1,0,0,0
2,3,0,6,0,0,1,0,1,0,1
3,2,2,6,0,1,2,1,1,1,0
4,2,2,5,4,1,1,0,4,0,1

In [76]:
filename = "clean/mauzo2.csv"
de = read_csv(filename)
de.head()

    rate  sales_in_first_month  sales_in_second_month  sales_in_third_month
0    two                   2.0                  500.0                   NaN
1    six                   4.0                    NaN                 650.0
2   four                 600.0                  200.0                 400.0
3   nine                   NaN                    NaN                 650.0
4  seven                 600.0                  250.0                 350.0

In [77]:
de.isnull().sum()

rate                     0
sales_in_first_month     1
sales_in_second_month    2
sales_in_third_month     1
dtype: int64

In [78]:
de['sales_in_first_month'].fillna(0, inplace=True)

In [79]:
de.head()

    rate  sales_in_first_month  sales_in_second_month  sales_in_third_month
0    two                   2.0                  500.0                   NaN
1    six                   4.0                    NaN                 650.0
2   four                 600.0                  200.0                 400.0
3   nine                   0.0                    NaN                 650.0
4  seven                 600.0                  250.0                 350.0

In [80]:
de['sales_in_second_month'].fillna(de['sales_in_second_month'].mean(), inplace=True)

In [81]:
de.head()

    rate  sales_in_first_month  sales_in_second_month  sales_in_third_month
0    two                   2.0                  500.0                   NaN
1    six                   4.0                  287.5                 650.0
2   four                 600.0                  200.0                 400.0
3   nine                   0.0                  287.5                 650.0
4  seven                 600.0                  250.0                 350.0

In [82]:
de['sales_in_second_month'].mean()

287.5

In [83]:
de['sales_in_third_month'].fillna(de['sales_in_third_month'].mean(), inplace=True)

In [84]:
de.head()

    rate  sales_in_first_month  sales_in_second_month  sales_in_third_month
0    two                   2.0                  500.0                 550.0
1    six                   4.0                  287.5                 650.0
2   four                 600.0                  200.0                 400.0
3   nine                   0.0                  287.5                 650.0
4  seven                 600.0                  250.0                 350.0

In [86]:
de['sales_in_third_month'].mean()

550.0

In [88]:
filename = "clean/bootcamp.csv"
mo = read_csv(filename)
mo.head()

       name   age      sex degree
0     Jacob  2000     male     SE
1  Alphonce    26     male     TE
2   Natalia    21   frmale    CIS
3   Mohamed    24     male    BIS
4     Kylie    20  &%%@#??     CE

In [89]:
from scipy import stats
import numpy as np

In [90]:
x = mo['age']
x.head()

0    2000
1      26
2      21
3      24
4      20
Name: age, dtype: int64

In [95]:
 v = np.abs(stats.zscore(x))
print(np.where( x > 200))

(array([0, 5], dtype=int64),)

In [96]:
mo.head(10)

       name   age      sex degree
0     Jacob  2000     male     SE
1  Alphonce    26     male     TE
2   Natalia    21   frmale    CIS
3   Mohamed    24     male    BIS
4     Kylie    20  &%%@#??     CE
5     Amina  2500   female    MTA